wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/sys_reg.h
     * |[7:4]   |PC1MFP    |PC.1 Multi-function Pin Selection
     * |[11:8]  |PC2MFP    |PC.2 Multi-function Pin Selection
     * |[15:12] |PC3MFP    |PC.3 Multi-function Pin Selection
     * |[19:16] |PC4MFP    |PC.4 Multi-function Pin Selection
     * |[23:20] |PC5MFP    |PC.5 Multi-function Pin Selection
     * |[27:24] |PC6MFP    |PC.6 Multi-function Pin Selection
     * |[31:28] |PC7MFP    |PC.7 Multi-function Pin Selection
     * @var SYS_T::GPC_MFPH
     * Offset: 0x44  GPIOC High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:24] |PC14MFP   |PC.14 Multi-function Pin Selection
     * @var SYS_T::GPD_MFPL
     * Offset: 0x48  GPIOD Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PD0MFP    |PD.0 Multi-function Pin Selection
     * |[7:4]   |PD1MFP    |PD.1 Multi-function Pin Selection
     * |[11:8]  |PD2MFP    |PD.2 Multi-function Pin Selection
     * |[15:12] |PD3MFP    |PD.3 Multi-function Pin Selection
     * @var SYS_T::GPD_MFPH
     * Offset: 0x4C  GPIOD High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:28] |PD15MFP   |PD.15 Multi-function Pin Selection
     * @var SYS_T::GPE_MFPH
     * Offset: 0x54  GPIOE High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:28] |PE15MFP   |PE.15 Multi-function Pin Selection
     * @var SYS_T::GPF_MFPL
     * Offset: 0x58  GPIOF Low Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PF0MFP    |PF.0 Multi-function Pin Selection
     * |[7:4]   |PF1MFP    |PF.1 Multi-function Pin Selection
     * |[11:8]  |PF2MFP    |PF.2 Multi-function Pin Selection
     * |[15:12] |PF3MFP    |PF.3 Multi-function Pin Selection
     * |[19:16] |PF4MFP    |PF.4 Multi-function Pin Selection
     * |[23:20] |PF5MFP    |PF.5 Multi-function Pin Selection
     * |[27:24] |PF6MFP    |PF.6 Multi-function Pin Selection
     * @var SYS_T::GPF_MFPH
     * Offset: 0x5C  GPIOF High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27:24] |PF14MFP   |PF.14 Multi-function Pin Selection
     * |[31:28] |PF15MFP   |PF.15 Multi-function Pin Selection
     * @var SYS_T::GPG_MFPH
     * Offset: 0x64  GPIOG High Byte Multiple Function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:4]   |PG9MFP    |PG.9 Multi-function Pin Selection
     * |[11:8]  |PG10MFP   |PG.10 Multi-function Pin Selection
     * |[15:12] |PG11MFP   |PG.11 Multi-function Pin Selection
     * |[19:16] |PG12MFP   |PG.12 Multi-function Pin Selection
     * @var SYS_T::GPA_MFOS
     * Offset: 0x80  GPIOA Multiple Function Output Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PA0MFOS   |PA.0 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.0 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[1]     |PA1MFOS   |PA.1 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.1 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[2]     |PA2MFOS   |PA.2 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.2 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[3]     |PA3MFOS   |PA.3 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.3 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[4]     |PA4MFOS   |PA.4 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.4 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[5]     |PA5MFOS   |PA.5 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.5 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[6]     |PA6MFOS   |PA.6 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.6 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[7]     |PA7MFOS   |PA.7 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.7 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[8]     |PA8MFOS   |PA.8 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.8 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[9]     |PA9MFOS   |PA.9 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.9 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[10]    |PA10MFOS  |PA.10 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.10 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[11]    |PA11MFOS  |PA.11 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.11 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[12]    |PA12MFOS  |PA.12 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.12 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[13]    |PA13MFOS  |PA.13 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.13 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[14]    |PA14MFOS  |PA.14 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.14 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[15]    |PA15MFOS  |PA.15 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PA.15 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * @var SYS_T::GPB_MFOS
     * Offset: 0x84  GPIOB Multiple Function Output Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PB0MFOS   |PB.0 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.0 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[1]     |PB1MFOS   |PB.1 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.1 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[2]     |PB2MFOS   |PB.2 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.2 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[3]     |PB3MFOS   |PB.3 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.3 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[4]     |PB4MFOS   |PB.4 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.4 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[5]     |PB5MFOS   |PB.5 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.5 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[6]     |PB6MFOS   |PB.6 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.6 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[7]     |PB7MFOS   |PB.7 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.7 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[8]     |PB8MFOS   |PB.8 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.8 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[9]     |PB9MFOS   |PB.9 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.9 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[10]    |PB10MFOS  |PB.10 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.10 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[11]    |PB11MFOS  |PB.11 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.11 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[12]    |PB12MFOS  |PB.12 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.12 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[13]    |PB13MFOS  |PB.13 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.13 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[14]    |PB14MFOS  |PB.14 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.14 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[15]    |PB15MFOS  |PB.15 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PB.15 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * @var SYS_T::GPC_MFOS
     * Offset: 0x88  GPIOC Multiple Function Output Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PC0MFOS   |PC.0 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.0 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[1]     |PC1MFOS   |PC.1 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.1 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[2]     |PC2MFOS   |PC.2 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.2 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[3]     |PC3MFOS   |PC.3 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.3 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[4]     |PC4MFOS   |PC.4 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.4 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[5]     |PC5MFOS   |PC.5 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.5 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[6]     |PC6MFOS   |PC.6 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.6 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[7]     |PC7MFOS   |PC.7 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.7 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[14]    |PC14MFOS  |PC.14 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PC.14 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * @var SYS_T::GPD_MFOS
     * Offset: 0x8C  GPIOD Multiple Function Output Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PD0MFOS   |PD.0 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PD.0 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[1]     |PD1MFOS   |PD.1 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PD.1 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[2]     |PD2MFOS   |PD.2 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PD.2 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[3]     |PD3MFOS   |PD.3 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PD.3 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[15]    |PD15MFOS  |PD.15 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PD.15 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * @var SYS_T::GPF_MFOS
     * Offset: 0x94  GPIOF Multiple Function Output Select Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PF0MFOS   |PF.0 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.0 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[1]     |PF1MFOS   |PF.1 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.1 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[2]     |PF2MFOS   |PF.2 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.2 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[3]     |PF3MFOS   |PF.3 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.3 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[4]     |PF4MFOS   |PF.4 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.4 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[5]     |PF5MFOS   |PF.5 Multiple Function Pin Output Mode Select
     * |        |          |This bit used to select multiple function pin output mode type for PF.5 pin.
     * |        |          |0 = Multiple function pin output mode type is Push-pull mode.
     * |        |          |1 = Multiple function pin output mode type is Open-drain mode.
     * |[15]    |PF15MFOS  |PF.15 Multiple Function Pin Output Mode Select
