wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/sys_reg.h
#define SYS_GPF_MFPL_PF5MFP_Pos          (20)                                              /*!< SYS_T::GPF_MFPL: PF5MFP Position       */
#define SYS_GPF_MFPL_PF5MFP_Msk          (0xful << SYS_GPF_MFPL_PF5MFP_Pos)                /*!< SYS_T::GPF_MFPL: PF5MFP Mask           */

#define SYS_GPF_MFPL_PF6MFP_Pos          (24)                                              /*!< SYS_T::GPF_MFPL: PF6MFP Position       */
#define SYS_GPF_MFPL_PF6MFP_Msk          (0xful << SYS_GPF_MFPL_PF6MFP_Pos)                /*!< SYS_T::GPF_MFPL: PF6MFP Mask           */

#define SYS_GPF_MFPH_PF14MFP_Pos         (24)                                              /*!< SYS_T::GPF_MFPH: PF14MFP Position      */
#define SYS_GPF_MFPH_PF14MFP_Msk         (0xful << SYS_GPF_MFPH_PF14MFP_Pos)               /*!< SYS_T::GPF_MFPH: PF14MFP Mask          */

#define SYS_GPF_MFPH_PF15MFP_Pos         (28)                                              /*!< SYS_T::GPF_MFPH: PF15MFP Position      */
#define SYS_GPF_MFPH_PF15MFP_Msk         (0xful << SYS_GPF_MFPH_PF15MFP_Pos)               /*!< SYS_T::GPF_MFPH: PF15MFP Mask          */

#define SYS_GPG_MFPH_PG9MFP_Pos          (4)                                               /*!< SYS_T::GPG_MFPH: PG9MFP Position       */
#define SYS_GPG_MFPH_PG9MFP_Msk          (0xful << SYS_GPG_MFPH_PG9MFP_Pos)                /*!< SYS_T::GPG_MFPH: PG9MFP Mask           */

#define SYS_GPG_MFPH_PG10MFP_Pos         (8)                                               /*!< SYS_T::GPG_MFPH: PG10MFP Position      */
#define SYS_GPG_MFPH_PG10MFP_Msk         (0xful << SYS_GPG_MFPH_PG10MFP_Pos)               /*!< SYS_T::GPG_MFPH: PG10MFP Mask          */

#define SYS_GPG_MFPH_PG11MFP_Pos         (12)                                              /*!< SYS_T::GPG_MFPH: PG11MFP Position      */
#define SYS_GPG_MFPH_PG11MFP_Msk         (0xful << SYS_GPG_MFPH_PG11MFP_Pos)               /*!< SYS_T::GPG_MFPH: PG11MFP Mask          */

#define SYS_GPG_MFPH_PG12MFP_Pos         (16)                                              /*!< SYS_T::GPG_MFPH: PG12MFP Position      */
#define SYS_GPG_MFPH_PG12MFP_Msk         (0xful << SYS_GPG_MFPH_PG12MFP_Pos)               /*!< SYS_T::GPG_MFPH: PG12MFP Mask          */

#define SYS_GPA_MFOS_PA0MFOS_Pos         (0)                                               /*!< SYS_T::GPA_MFOS: PA0MFOS Position      */
#define SYS_GPA_MFOS_PA0MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA0MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA0MFOS Mask          */

#define SYS_GPA_MFOS_PA1MFOS_Pos         (1)                                               /*!< SYS_T::GPA_MFOS: PA1MFOS Position      */
#define SYS_GPA_MFOS_PA1MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA1MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA1MFOS Mask          */

#define SYS_GPA_MFOS_PA2MFOS_Pos         (2)                                               /*!< SYS_T::GPA_MFOS: PA2MFOS Position      */
#define SYS_GPA_MFOS_PA2MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA2MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA2MFOS Mask          */

#define SYS_GPA_MFOS_PA3MFOS_Pos         (3)                                               /*!< SYS_T::GPA_MFOS: PA3MFOS Position      */
#define SYS_GPA_MFOS_PA3MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA3MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA3MFOS Mask          */

#define SYS_GPA_MFOS_PA4MFOS_Pos         (4)                                               /*!< SYS_T::GPA_MFOS: PA4MFOS Position      */
#define SYS_GPA_MFOS_PA4MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA4MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA4MFOS Mask          */

#define SYS_GPA_MFOS_PA5MFOS_Pos         (5)                                               /*!< SYS_T::GPA_MFOS: PA5MFOS Position      */
#define SYS_GPA_MFOS_PA5MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA5MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA5MFOS Mask          */

#define SYS_GPA_MFOS_PA6MFOS_Pos         (6)                                               /*!< SYS_T::GPA_MFOS: PA6MFOS Position      */
#define SYS_GPA_MFOS_PA6MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA6MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA6MFOS Mask          */

#define SYS_GPA_MFOS_PA7MFOS_Pos         (7)                                               /*!< SYS_T::GPA_MFOS: PA7MFOS Position      */
#define SYS_GPA_MFOS_PA7MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA7MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA7MFOS Mask          */

#define SYS_GPA_MFOS_PA8MFOS_Pos         (8)                                               /*!< SYS_T::GPA_MFOS: PA8MFOS Position      */
#define SYS_GPA_MFOS_PA8MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA8MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA8MFOS Mask          */

#define SYS_GPA_MFOS_PA9MFOS_Pos         (9)                                               /*!< SYS_T::GPA_MFOS: PA9MFOS Position      */
#define SYS_GPA_MFOS_PA9MFOS_Msk         (0x1ul << SYS_GPA_MFOS_PA9MFOS_Pos)               /*!< SYS_T::GPA_MFOS: PA9MFOS Mask          */

#define SYS_GPA_MFOS_PA10MFOS_Pos        (10)                                              /*!< SYS_T::GPA_MFOS: PA10MFOS Position     */
#define SYS_GPA_MFOS_PA10MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA10MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA10MFOS Mask         */

#define SYS_GPA_MFOS_PA11MFOS_Pos        (11)                                              /*!< SYS_T::GPA_MFOS: PA11MFOS Position     */
#define SYS_GPA_MFOS_PA11MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA11MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA11MFOS Mask         */

#define SYS_GPA_MFOS_PA12MFOS_Pos        (12)                                              /*!< SYS_T::GPA_MFOS: PA12MFOS Position     */
#define SYS_GPA_MFOS_PA12MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA12MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA12MFOS Mask         */

#define SYS_GPA_MFOS_PA13MFOS_Pos        (13)                                              /*!< SYS_T::GPA_MFOS: PA13MFOS Position     */
#define SYS_GPA_MFOS_PA13MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA13MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA13MFOS Mask         */

#define SYS_GPA_MFOS_PA14MFOS_Pos        (14)                                              /*!< SYS_T::GPA_MFOS: PA14MFOS Position     */
#define SYS_GPA_MFOS_PA14MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA14MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA14MFOS Mask         */

#define SYS_GPA_MFOS_PA15MFOS_Pos        (15)                                              /*!< SYS_T::GPA_MFOS: PA15MFOS Position     */
#define SYS_GPA_MFOS_PA15MFOS_Msk        (0x1ul << SYS_GPA_MFOS_PA15MFOS_Pos)              /*!< SYS_T::GPA_MFOS: PA15MFOS Mask         */

#define SYS_GPB_MFOS_PB0MFOS_Pos         (0)                                               /*!< SYS_T::GPB_MFOS: PB0MFOS Position      */
#define SYS_GPB_MFOS_PB0MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB0MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB0MFOS Mask          */

#define SYS_GPB_MFOS_PB1MFOS_Pos         (1)                                               /*!< SYS_T::GPB_MFOS: PB1MFOS Position      */
#define SYS_GPB_MFOS_PB1MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB1MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB1MFOS Mask          */

#define SYS_GPB_MFOS_PB2MFOS_Pos         (2)                                               /*!< SYS_T::GPB_MFOS: PB2MFOS Position      */
#define SYS_GPB_MFOS_PB2MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB2MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB2MFOS Mask          */

#define SYS_GPB_MFOS_PB3MFOS_Pos         (3)                                               /*!< SYS_T::GPB_MFOS: PB3MFOS Position      */
#define SYS_GPB_MFOS_PB3MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB3MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB3MFOS Mask          */

#define SYS_GPB_MFOS_PB4MFOS_Pos         (4)                                               /*!< SYS_T::GPB_MFOS: PB4MFOS Position      */
#define SYS_GPB_MFOS_PB4MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB4MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB4MFOS Mask          */

#define SYS_GPB_MFOS_PB5MFOS_Pos         (5)                                               /*!< SYS_T::GPB_MFOS: PB5MFOS Position      */
#define SYS_GPB_MFOS_PB5MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB5MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB5MFOS Mask          */

#define SYS_GPB_MFOS_PB6MFOS_Pos         (6)                                               /*!< SYS_T::GPB_MFOS: PB6MFOS Position      */
#define SYS_GPB_MFOS_PB6MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB6MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB6MFOS Mask          */

#define SYS_GPB_MFOS_PB7MFOS_Pos         (7)                                               /*!< SYS_T::GPB_MFOS: PB7MFOS Position      */
#define SYS_GPB_MFOS_PB7MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB7MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB7MFOS Mask          */

#define SYS_GPB_MFOS_PB8MFOS_Pos         (8)                                               /*!< SYS_T::GPB_MFOS: PB8MFOS Position      */
#define SYS_GPB_MFOS_PB8MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB8MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB8MFOS Mask          */

#define SYS_GPB_MFOS_PB9MFOS_Pos         (9)                                               /*!< SYS_T::GPB_MFOS: PB9MFOS Position      */
#define SYS_GPB_MFOS_PB9MFOS_Msk         (0x1ul << SYS_GPB_MFOS_PB9MFOS_Pos)               /*!< SYS_T::GPB_MFOS: PB9MFOS Mask          */

#define SYS_GPB_MFOS_PB10MFOS_Pos        (10)                                              /*!< SYS_T::GPB_MFOS: PB10MFOS Position     */
#define SYS_GPB_MFOS_PB10MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB10MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB10MFOS Mask         */

#define SYS_GPB_MFOS_PB11MFOS_Pos        (11)                                              /*!< SYS_T::GPB_MFOS: PB11MFOS Position     */
#define SYS_GPB_MFOS_PB11MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB11MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB11MFOS Mask         */

