wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/sys_reg.h
#define SYS_GPB_MFOS_PB12MFOS_Pos        (12)                                              /*!< SYS_T::GPB_MFOS: PB12MFOS Position     */
#define SYS_GPB_MFOS_PB12MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB12MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB12MFOS Mask         */

#define SYS_GPB_MFOS_PB13MFOS_Pos        (13)                                              /*!< SYS_T::GPB_MFOS: PB13MFOS Position     */
#define SYS_GPB_MFOS_PB13MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB13MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB13MFOS Mask         */

#define SYS_GPB_MFOS_PB14MFOS_Pos        (14)                                              /*!< SYS_T::GPB_MFOS: PB14MFOS Position     */
#define SYS_GPB_MFOS_PB14MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB14MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB14MFOS Mask         */

#define SYS_GPB_MFOS_PB15MFOS_Pos        (15)                                              /*!< SYS_T::GPB_MFOS: PB15MFOS Position     */
#define SYS_GPB_MFOS_PB15MFOS_Msk        (0x1ul << SYS_GPB_MFOS_PB15MFOS_Pos)              /*!< SYS_T::GPB_MFOS: PB15MFOS Mask         */

#define SYS_GPC_MFOS_PC0MFOS_Pos         (0)                                               /*!< SYS_T::GPC_MFOS: PC0MFOS Position      */
#define SYS_GPC_MFOS_PC0MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC0MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC0MFOS Mask          */

#define SYS_GPC_MFOS_PC1MFOS_Pos         (1)                                               /*!< SYS_T::GPC_MFOS: PC1MFOS Position      */
#define SYS_GPC_MFOS_PC1MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC1MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC1MFOS Mask          */

#define SYS_GPC_MFOS_PC2MFOS_Pos         (2)                                               /*!< SYS_T::GPC_MFOS: PC2MFOS Position      */
#define SYS_GPC_MFOS_PC2MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC2MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC2MFOS Mask          */

#define SYS_GPC_MFOS_PC3MFOS_Pos         (3)                                               /*!< SYS_T::GPC_MFOS: PC3MFOS Position      */
#define SYS_GPC_MFOS_PC3MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC3MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC3MFOS Mask          */

#define SYS_GPC_MFOS_PC4MFOS_Pos         (4)                                               /*!< SYS_T::GPC_MFOS: PC4MFOS Position      */
#define SYS_GPC_MFOS_PC4MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC4MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC4MFOS Mask          */

#define SYS_GPC_MFOS_PC5MFOS_Pos         (5)                                               /*!< SYS_T::GPC_MFOS: PC5MFOS Position      */
#define SYS_GPC_MFOS_PC5MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC5MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC5MFOS Mask          */

#define SYS_GPC_MFOS_PC6MFOS_Pos         (6)                                               /*!< SYS_T::GPC_MFOS: PC6MFOS Position      */
#define SYS_GPC_MFOS_PC6MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC6MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC6MFOS Mask          */

#define SYS_GPC_MFOS_PC7MFOS_Pos         (7)                                               /*!< SYS_T::GPC_MFOS: PC7MFOS Position      */
#define SYS_GPC_MFOS_PC7MFOS_Msk         (0x1ul << SYS_GPC_MFOS_PC7MFOS_Pos)               /*!< SYS_T::GPC_MFOS: PC7MFOS Mask          */

#define SYS_GPC_MFOS_PC14MFOS_Pos        (14)                                              /*!< SYS_T::GPC_MFOS: PC14MFOS Position     */
#define SYS_GPC_MFOS_PC14MFOS_Msk        (0x1ul << SYS_GPC_MFOS_PC14MFOS_Pos)              /*!< SYS_T::GPC_MFOS: PC14MFOS Mask         */

#define SYS_GPD_MFOS_PD0MFOS_Pos         (0)                                               /*!< SYS_T::GPD_MFOS: PD0MFOS Position      */
#define SYS_GPD_MFOS_PD0MFOS_Msk         (0x1ul << SYS_GPD_MFOS_PD0MFOS_Pos)               /*!< SYS_T::GPD_MFOS: PD0MFOS Mask          */

#define SYS_GPD_MFOS_PD1MFOS_Pos         (1)                                               /*!< SYS_T::GPD_MFOS: PD1MFOS Position      */
#define SYS_GPD_MFOS_PD1MFOS_Msk         (0x1ul << SYS_GPD_MFOS_PD1MFOS_Pos)               /*!< SYS_T::GPD_MFOS: PD1MFOS Mask          */

#define SYS_GPD_MFOS_PD2MFOS_Pos         (2)                                               /*!< SYS_T::GPD_MFOS: PD2MFOS Position      */
#define SYS_GPD_MFOS_PD2MFOS_Msk         (0x1ul << SYS_GPD_MFOS_PD2MFOS_Pos)               /*!< SYS_T::GPD_MFOS: PD2MFOS Mask          */

#define SYS_GPD_MFOS_PD3MFOS_Pos         (3)                                               /*!< SYS_T::GPD_MFOS: PD3MFOS Position      */
#define SYS_GPD_MFOS_PD3MFOS_Msk         (0x1ul << SYS_GPD_MFOS_PD3MFOS_Pos)               /*!< SYS_T::GPD_MFOS: PD3MFOS Mask          */

#define SYS_GPD_MFOS_PD15MFOS_Pos        (15)                                              /*!< SYS_T::GPD_MFOS: PD15MFOS Position     */
#define SYS_GPD_MFOS_PD15MFOS_Msk        (0x1ul << SYS_GPD_MFOS_PD15MFOS_Pos)              /*!< SYS_T::GPD_MFOS: PD15MFOS Mask         */

#define SYS_GPF_MFOS_PF0MFOS_Pos         (0)                                               /*!< SYS_T::GPF_MFOS: PF0MFOS Position      */
#define SYS_GPF_MFOS_PF0MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF0MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF0MFOS Mask          */

#define SYS_GPF_MFOS_PF1MFOS_Pos         (1)                                               /*!< SYS_T::GPF_MFOS: PF1MFOS Position      */
#define SYS_GPF_MFOS_PF1MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF1MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF1MFOS Mask          */

#define SYS_GPF_MFOS_PF2MFOS_Pos         (2)                                               /*!< SYS_T::GPF_MFOS: PF2MFOS Position      */
#define SYS_GPF_MFOS_PF2MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF2MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF2MFOS Mask          */

#define SYS_GPF_MFOS_PF3MFOS_Pos         (3)                                               /*!< SYS_T::GPF_MFOS: PF3MFOS Position      */
#define SYS_GPF_MFOS_PF3MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF3MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF3MFOS Mask          */

#define SYS_GPF_MFOS_PF4MFOS_Pos         (4)                                               /*!< SYS_T::GPF_MFOS: PF4MFOS Position      */
#define SYS_GPF_MFOS_PF4MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF4MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF4MFOS Mask          */

#define SYS_GPF_MFOS_PF5MFOS_Pos         (5)                                               /*!< SYS_T::GPF_MFOS: PF5MFOS Position      */
#define SYS_GPF_MFOS_PF5MFOS_Msk         (0x1ul << SYS_GPF_MFOS_PF5MFOS_Pos)               /*!< SYS_T::GPF_MFOS: PF5MFOS Mask          */

#define SYS_GPF_MFOS_PF15MFOS_Pos        (15)                                              /*!< SYS_T::GPF_MFOS: PF15MFOS Position     */
#define SYS_GPF_MFOS_PF15MFOS_Msk        (0x1ul << SYS_GPF_MFOS_PF15MFOS_Pos)              /*!< SYS_T::GPF_MFOS: PF15MFOS Mask         */

#define SYS_GPG_MFOS_PG9MFOS_Pos         (9)                                               /*!< SYS_T::GPG_MFOS: PG9MFOS Position      */
#define SYS_GPG_MFOS_PG9MFOS_Msk         (0x1ul << SYS_GPG_MFOS_PG9MFOS_Pos)               /*!< SYS_T::GPG_MFOS: PG9MFOS Mask          */

#define SYS_GPG_MFOS_PG10MFOS_Pos        (10)                                              /*!< SYS_T::GPG_MFOS: PG10MFOS Position     */
#define SYS_GPG_MFOS_PG10MFOS_Msk        (0x1ul << SYS_GPG_MFOS_PG10MFOS_Pos)              /*!< SYS_T::GPG_MFOS: PG10MFOS Mask         */

